/*
#include - включение файлов,
#define - определение макросов,
#undef - отмена определения макроса,
#if, #ifdef, #ifndef, #else, #elif, #endif - условная компиляция,
#error - генерация ошибки компиляции,
#pragma - инструкции компилятору,
# и ## - операторы подстановки внутри макросов.

#include <file.h> - поиск в системных каталогах.
#include "file.h" - поиск в текущем каталоге (проекте), затем в системных.

1. Определение имени без значения для условной компиляции
#define TRACE_VARS
где-то позже:
#ifdef TRACE_VARS
    printf("%d %d %d\n", x, y, z)
#endif

2. Определение константы
#define MAGIC (0xDEADBEAF)

3. Маскрос с параметрами
определение #define SQUARE(x) ((x)*(x))

w = SQUARE(v); // ;

isatty() связан ли файл с консолью/терминалом
*/
