/*
Undefined Behaviour

1. Выход за пределы массива
int arr[5];
arr[5] == 42 // Индекс за пределами 0...4

2. Целочисленное деление на ноль
#include <stdio.h>
int main() {
    double a = 1.0, b = 0.0, c = 0.0;
    printf("f\n", a / b); // обычно inf
    printf("f\n", -a / b); // обычно -inf
    printf("f\n", c / b); // обычно nan
    return 0;
}

3. Использование неинициализированной автоматической переменной
автоматическая != глобальная, не статическая
int x;
printf("%d", x); // x не инициализирован

4. Двойной освобождение  памяти
int *p = malloc(sizeof(int));
free(p);
free(p);

5. Использование указателя после освобождения (use-after-free)

6. Арифметика указателя за пределами объекта

7. Изменение строкового литерала (константной строки)

8. Обращение к объекту через указатель несовместимого типа

9. Переполнение целого со знаком

10. Сдвиг на атрицательное число или на величину >= ширины типа
int x = 1;
x = x << 64; // UB, если int занимает 32 бита
x = x >> -1; // UB

11. Вызов функции с несоответствием типов/количества аргументов (без прототипа)

12. Функция не возвращает значение, но его пытаеются вызвать

13. Два изменения одной переменной без промежуточной точки следования (sequence point)
int i = 0;
i = i++ + 1 // UB (не определено, когда произойдет инкремент)

14. Чтение и запись в одно и то же выражение с побочными эффектами
int i = 0;
int a = i++ + i++; // UB

a[i] = i++;
a[i++] = i;

15. Сравнение указателей в одно и то же выражение с побочными эффектами
Неопределенного поведения в коде стоит избегать


Вариадические функции - функции, которые могу принимать любое количество аргументов
int sum(int count, ...){} // передаем количество аргументов count, затем берем неопределенное число аргументов

*/