/*
Поиск и сортировка
https://algostructure.com/ анимированные алгоритмы сортировки

Ассоциативные списки (словари)
К ним примыкают множества, как абстракный тип данных (набор неповторяющихся значений)

Линейный поиск последовательности
"Разделяй и властвуй" - схема разработки алгоритма, заключающаяся в рекурсивном разбиении
решаемой задачи на две или более подзадачи того же типа.

Бинарный (двоичный) поиск
Идея - поиск элемента в отсортированном массиве путем последовательного деления области
поиска пополам. На каждом шаге алгоритм сравнивает искомое значение со средним элементом текущего диапазона и,
в зависимости от результата, отбрасывает половину, в которой элемент находится не может. Это позволяет
сократить область поиска вдвое => сложность O(log(n)).

Сортировка - упорядочивание элементов в списке.
Для того чтобы она была возможна, нам нужна операция порядка
f(A, B) = {-1, A<B; 0, A=B; 1, A>B}

Сортировка вставками, сложность O(n**2), стабилен
Сортировка пузырьком, сложность O(n**2), стабилен
Быстрая сортировка - требует дополнительной памяти (O(lon(n)),
сложность O(n**2) в худшем случаее, обычно O(n*log(n)) нестабилен.

Стабильность сортировки - это свойство алгоритма сортировки сохранять относительный порядок
равных элементов.

Быстрая сортировка
Алгоритм
1. Выбрать элемент из массива. Назовем его опорным.
2. Выполнить разбиение массива: перераспределение элементов в массиве таким образом,
что элементы, меньшие опорного, помещается перед ним, а большие или равные - после.
3. Рекурсивно применить первые два шага к двум подмассивам слева и справа от опорного элемента.
Рекурсия не применяется к массиву, в котором один элемент.

Функция qsort()

Поиск по ключу без сортировки: хеш-таблица
Идея: располагать в массиве пары ключ-значение.
Хеш-функция - отображает множество ключей на множество индексов массива.
Принимает последовательность символов или последовательность байтов и возвращает строку или число
фиксированной длины (хеш), по которой невозможно восстановить текстЮ но которая этот текст характеризует.
i = H(k) mod L;
i - индекс, k - ключ, H(k) - хеш-функция, L - число элементов таблицы.

Коллизия - ситуация, когда разные ключи дают одинаковый хеш.
Коэффициент заполнения - отношение числа элементов к размеру таблицы.
Хеш-функция:
  | ключ | значение |
0 |      |          |
1 |      |          |
2 |      |          |
Длина L


*/