/*
Язык C: ввод-вывод, работа с файлами + разное

Файлы, ввод-вывод:
В UNIX и UNIX-подобных системах все - файл

Ввод-вывод на языке C:
Буферизованный = основанный на потоках (stdio.h).
Небуферизованный = основанный на системных вызовах (fcntl.h, unistd.h).

                   Буф          Не буф
Заголовочный файл  <stdio.h>    <unistd.h>, <fcntl.h>
Идентификатор      FILE *       int fd
Буфер              Да    Нет
Переносимость      ANSI C       POSIX
Скорость операций  Высокая      Низкая
Возможности        Ограниченные Полные

Потоковый ввод-вывод:
Поток - логическое устройство, связанное с файлом, через которое выполняется последовательный
обмен данными.

Логическое устройство - это абстракция (по сути АТД), обеспечивающее единый интерфейс
для различных устройств.

Функции для работы с потоками ввода-вывода
Открытие файла:
fopen   FILE *fopen(const char *path, const char *mode); Открывает файл и возвращает поток
freopen
fclose int fclose(FILE *stream); Закрывает поток, сбрасывает буфер
fflush пренудительно записывает содержимое буфера на диск

Посимвольный ввод:
fgetc int fgetc(FILE *stream) Читает один символ (возвращает int)

Посимвольный вывод:
fputc int fputc(int c, FILE *stream) Записывает один символ

Блочный ввод / вывод:
fread читает nmemb элементов размера size
fwrite записывает nmemb элементов размера size

Форматированный ввод fscanf Форматированные чтение файла

Позиционирование:
fseek помещает указатель позиции
ftell возвращает текущую позицию
rewind перемещает в начало файла
fgetpos сохраняет текущую позицию
fsetpos восстанавливает позицию

Проверка состояния:
feof проверяет достижение конца файла
ferror проверяет наличие ошибки потока
clearerr Сбрасывает флаги EOF и ошибки
perror печатает сообщение об ошибке

Управление буфером:
setvbuf задает режим и размер буфера

Работа с дескриптором:
fileno возвращает файловый дескриптор

Шаблонный код:
FILE *f = fopen("file.txt", "r");
if (!f) {
    perror("fopen");
    return 1;
}

char line[256]
while (fgets(line, sizeof(line), f)){
    fputs(line, stdout);
}

if (ferror(f)) perror("read");

fclose(f);

Режимы открытия файла:
"r" - чтение текстового файла
"w" - запись, содержимое создается заного
"a" - добавление в конец (append)
"r+" - чтение и запись, файл должен соществовать
"w+" - чтение и запись
"a+" - чтение и запись
"rd", "wb", "ab", и т. д. - работа с двоичными данными

// ПРАВИЛЬНО
int c;
while ((c = fgets(f)) != EOF) {}

Работа с буфером как с файлом

int main(void) {
    char buffer[100] = {0};
    FILE *file_w = fmemopen(buffer, sizeof(buffer), "w");
    if (file_w == NULL) {
        perror("fmemopen (write)");
        return 1
    }
}

Каждый процесс имеет 1 поток ввода и 2 потока вывода
stdin для ввода (стандартный дескриптор 0)
stdout для вывода (стандартный дескриптор 1)
stderr для вывода сообщений об ошибках (стандартный дескриптор 2)

Работа со стандартными потоками ввода-вывода в интерпретаторе команд
command > file # stdout в файл (перезапись)
command >> file # stdout в файл (добавление)
command 2> file # stderr в файл
command 2>> file # stderr в файл (добавление)
command  &> file #stdout и stdierr в файл & значит запустить команду в бекграунде
command > file 2>&l # то же самое (классический синтаксис)

command < file # stdin из файла
command < file1 > file2 # ввод из file1, вывод в file2

ps в консоли выводит процессы запущенные в системе

ps -ef
ps -ef | grep term вывод ps пойдет на вход grep

Небуферизованный ввод-вывод в языке C
Файловый дескриптор - целое неотрицательное число, которое операционная система возвращает
процессу при открытии файла.

Переход от структуры FILE к дескриптору и обратно
int fileno(FILE *stream); // получить дескриптор
FILE *fdopen(int fd, const char *mode);

Основные операции с дескрипторами
Открыть файл open()
Создать файл creat()
Закрыть close()
Чтение ssize_t read()
Запись ssize_t write()
Получить инормацию fstat() Возвращает метаданные открытого файла
Метаданные - это данные о данных (размер, каталог и т. д.)

Пример
int main(void) {
    char buf[4096];
    int fd = open("/tmp/demo.txt" 0_RDONLY);
    if (fd == -1) return 1;

    ssize_t n;
    while ((n = read(fd, buf, sizeof buf)) > 0){
        write(STDOUT_FILENO, buf, n);

    close(fd);
    return 0;
}

Файловая система - часть операционной системы, которая обеспечивает
интерфейс для работы с данными на устройствах хранения и управляет совместным
доступом к файлам

В основном выполняется в рамках стандарта POSIX.

POSIX (Portable Operating System Interface, "переносимый интерфейс операционной системы") -
набор стандартов, описывающих интерфейс между операционной системой и программами

Удалить файл unlink()
Переименовать/переместить rename()
Получить метаданные stat()
Получить метаданные по дескриптору fstat()
Изменить права доступа chmod()
Изменить владельца chown()
Создать каталог mkdir()
Удалить каталог rmdir()
Открыть каталог DIR *opendir()
Чтение записи каталога struct dirent *readdir()
Закрыть каталог closedir()
Сменить текущий каталог chdir()
Получить текущий каталог *getcwd()
Создать жесткую ссылку link()
Создать символическую ссылку symlink()

Дерево каталогов:
bin - команды
boot - данные о загрузке
dev - устройства, которые присутствуют в системе
etc - системные настройки (имя хоста)
home - домашние каталоги пользователя
lib - разделяемые библиотеки
lib64 - разделяемые библиотеки
proc - в виде файлов перечислены все процессы, доступные в системе в данный момент
root - администратор, которые управляет компьютером
tmp - временные данные

Права доступа
rwx (read, write, x (исполнять))
drwxr-xr-x
rwx - пользователь
r-x - группа
r-x - другие


Порядок байтов
От старшего к младшему (Big-Endian, BE) - характерно для старых систем (PowerPC, SPARC), протокола TCP/IP
От младшего к старшему (Little-Endian, LE) - характерно для современных систем (x86, ESP32)

BE:
Адрес: A          A+1
Байт:  0x12       0x34
Биты:  0001 0010  0011 0100

LE:
Адрес: A         A+1
Байт:  0x34       0x12
Биты:  0011 0100  0001 0010




*/