//
// Created by Vlad on 23.09.2026.
//
#include <stdio.h>
#include <stdint.h>

int main(void) {
    char c[]="hello world!";
    for (int i=0;i<30;i++) {
        printf("%c, %x \n",c[i],c[i]);
    }
    //int x; // 4 байта
    // x = 10;
    /*
     int8_t - 1 байт
     int16_t - 2 байта
     int32_t - 4 байта
     int64_t - 8 байта
     */
    // int *p; // 8 байт указывает на обьект в 4 байт и работает по нему как с int
    // p = 0;
    int y = 42;
    int *x = &y; // нужно указать адрес на переменную y, которая имеет значение 32
    printf("%d\n", *x); // указатель возвращает адрес
    // %s - Сшная строка которая выводит значения до нулевого байта '\0'
    // printf("%s", 100500); нет '\0'
    // int x[80]; массив из 80 intов, в каждом из которых 4 байта, то есть 4*80=320 байт
    /*
    &x[2] - &x[0] = 2

    void - возвращает ничего
    void* - возвращает 8 байт

    char* - нужен для того чтобы адресоваться к единичному байту
    (void*)&x[2] - (void*)&x[0] = 8
    (int16**)&x[2] - (int16**)&x[0] = 4

    (int64_t*)&x[3] - (int64_t*)&x[0] - ошибка
    (int64_t*)&x[3] 100600 + 3*8 = 100624 не делится на 8

    *(int*)3 - 3*4=12 не делится на 8 - ошибка
    *
    struct {
        int x; 4 байта
        long y; 8 байт - склеивает по кусочкам
    }

    int *p = &x[0]; p = 100600
    p + 3 = 100612 100600+3*4=100612

    (void*)p
    +3*sizeof(int)

    Работа на c это в основном работа с памятью

    int x
    |  область памяти   |
       x
    |     область памяти     |
            main

    int main(){
    printf("%p\n", main); выводит адрес main
    }

    x, main, printf - все эти вещи называются СИМВОЛ
    при чтении для всех символов выделяется память, достаются функции

    int x; - глобальный символ, живет только в пределах вне функции
    int main() {
        int x; другой символ, живет только в пределах main()
        if () {
            int x; - живет только в пределах if
            p = &x;

        }
        *p = 42;
    }

    frame - локальное место для выполнения функций
    к нему можно прицеплять память с адресом, которая работает только в пределах
    чего нибудь, например, if или функции main

    frameов может быть много они могут быть связаны друг с другом
    адресами и вместе образуют stack

    Tail Call Optimization (TCO) (оптимизация вызова)
    метод оптимизации, который переиспользует один и тоже frame, для разных
    функций.

    Цикл - это по сути рекурсия

    frame в данном контексте область видимости

    int main(int, char*[]) массив указателей
    int (*p)(int char*[])
    p(0, NULL)

    cdecl
    cdecl.org - объясняет int (*p)(int char*[]) вот такие объявления

    int main( ....){
        .
        .
        .
        main
    }

    Любая программа на с сводится к манипуляции с памятью

    int *p = ..... вне зависимости от значения
    *p = 10;
    while (*p>0){
        sleep(1); бесконечный сон
    }

    volatile int *p = ..... volatile - указание компилятору, что *p может поменяться
    вместо .... можно написать что то, чтобы сон не был бесконечным

    *p = 10;
    while (*p>0){
        sleep(1); бесконечный сон
    }


    int x = 42;
    func(x); // создает в память копию области в памяти на 4 байта
    func(int y){ // создает в памяти область на 4 байта
    y = 15;
    }

    int x = 42;
    func(&x); // позволяет не создавать копию и записывает новое значение по
    указателю в одну область памяти
    func(int *y) { // создает в памяти область на 4 байта
    *y = 15;
    }

    int x;
    if (x > 10){
        y = 3;
    } else {
        y = 5;
        }

    В Python:

    myprog.py
    def main(): // без вызова main функция только создается и все
        print("Hello, world")

    if __name__ == '__main__':
        main() top-level

    в С:

    int x;
    int main(){ // main сама запускается
        printf....
    }


    int g1, g2; // равны 0 по умолчанию
    int main(){
        int l1, l2; // будут равны мусор, живут на стеке, локальные, имена живут до компиляции
        printf("%d %d %d %d\n", g1, g2, l1, l2);
        printf("%p, %p, %p, %p\n", &g1, &g2, &l1, &l2);
    }

    int x = 10; // x и y живут в памяти отдельно
    int y = x + 5;

    выполняется код только внутри функции
    top level - то, что находится вне функций

     declaration - объявление
     definition - определение. если есть definition, то есть и declaration

     int f();
     int g(){
        f();
     }
     int f();

     объявления функции нужны для того чтобы понимать какой код нужно взять и из какой библиотеки

     main(){
        printf("Hello, world\n"); // будет работать, одно неявное объявление
        printf("%d", 42); // не будет работать
     }

     int (*f)(void) = 5; // создаем переменную, которая является указателм на функцию,
     которой точно нет
        f(); // вызов сбоя

    создание массива sizeof + 5*sizeof(int)

    malloc(размер) - пытается найти в памяти место, где столько, сколько
    мы попросили байт есть. Возвращает адрес места в памяти и говорит,
    что во столько быйт можно использовать

    calloc(размер, количество) - то же самое что и malloc, но зачистит нулями область

    realloc(указатель, размер) - пытается выделить память под новый размер,
    затем содержимое по указателю пытается перенести данные в новое место и вернет указатель.

    free() освобождате память

    free(NULL) ничего плохого не сделает

    int x = 1234;
    char *p = &x;
    for (int i = 0; i < sizeof(p); i++){
    вывести адреса
    }

    объявление переменных
    тип название
    typedef тип; название типа;
    typedef int x
    x a = 10

    typedef struct my_string
    typedef struct my_s{
    } my_t;
    struct my_S x;
    typedef позволяет вместо struct my_s писать my_s

    Компиляция
    код -> препроцессор -> символы ->  работающая программа

    Препроцессор:
    #include <stdio.h>
    #define X "123"
    #define A(x, y, z)(x+y*z)
    #define square(x) ((x)*(x)) - текстовая замена square(x) на то что она определяет
    проблема: square(x++) x++ * x++
    #define FOREACH(list, var)
    FOREACH(list, ptr) {}
    NULL это #define NULL ((void*)0)
    #define DEBUG // определение DEBUG
    #ifdef DEBUG
        printf(...) // исполняется если DEBUG определен
    #endif

    cc -o main main.c -D DEBUG // определение DEBUG при запуске программы

    int my_a;
    int my_b;
    #define MY(x) (my_##x)
        MY(a)

    # токен
     "токен"

    #define DBG(x)
        printf(#x " = %d\n", x)
               "x"

    Макросы
    __FILE__
    __LINE__
    __function__
    раскрывают название файла, номер текущей строки и наименование функции


    Cимволы:
    main
    printf

    linker - компоновщик, связывает между собой символы

    */
}